import pandas as pd


df=pd.read_csv("행정구역시군구별성별인구수.csv") # 파일 csv형태로 읽어들이기
df.drop(axis=0, index=[0], inplace=True) # 헤더 행 1줄 제거
df["행정구역(시군구)별2"]=df["행정구역(시군구)별"] # 새로운 열 생성하여 데이터 똑같이 집어넣기
df.reset_index(drop=True, inplace=True) # 인덱스 새로 생성

local=['전국','강원도', '경기도', '경상남도', '경상북도' ,'인천광역시', '대구광역시', '전라남도', '대전광역시' ,'광주광역시',
 '제주특별자치도' ,'부산광역시' ,'전라북도', '충청북도' ,'서울특별시', '충청남도', '울산광역시'] # 전국 리스트 생성

current_local="전국" # 현재 위치 -> 전국
for i in range(df.shape[0]): # 행 갯수만큼 반복
    if df["행정구역(시군구)별"][i] in local : # 도시이름과 똑같은 행이 나온다면
        current_local=df["행정구역(시군구)별"][i] # 현재 위치를 해당 도시이름으로 교체
        df["행정구역(시군구)별2"][i]="소계" # 새로 생성한 열에 "소계"라고 작성
    else :
        df["행정구역(시군구)별2"][i]=df["행정구역(시군구)별"][i] # 새로 생성한 열에 구별 정보 입력
        df["행정구역(시군구)별"][i]=current_local # 원래 있던 열에는 현재 도시 이름을 입력
        
df=df.reindex(columns=["행정구역(시군구)별", "행정구역(시군구)별2","2023.12"]) # 열 순서 변경
df.rename(columns={"2023.12":"총인구수 (명)","행정구역(시군구)별":"행정구역(시도)별1"}, inplace=True) # 열 이름 변경
df.to_excel("행정구역시도별성별인구수.xlsx", index=False) # 엑셀 파일로 내보내기